In [1]:
import numpy as np
import pandas as pd
import datetime

In [3]:
time = pd.read_csv("time_data_messages.csv")

In [4]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [5]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

# converitng it's object to datetime formate:

In [6]:
time["date"] = pd.to_datetime(time["date"])

In [11]:
time = time.drop(columns=time.columns[-1])

In [12]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 7.9 KB

In [15]:
time["hours"] = time["date"].dt.hour
time.head()

                 date  hours
0 2013-12-15 00:50:00      0
1 2014-04-29 23:40:00     23
2 2012-12-30 00:21:00      0
3 2014-11-28 00:31:00      0
4 2013-10-26 23:11:00     23

In [18]:
time["minutes"] = time["date"].dt.minute
time.head()

                 date  hours  minutes
0 2013-12-15 00:50:00      0       50
1 2014-04-29 23:40:00     23       40
2 2012-12-30 00:21:00      0       21
3 2014-11-28 00:31:00      0       31
4 2013-10-26 23:11:00     23       11

In [19]:
time["seconds"] = time["date"].dt.second
time.head()

                 date  hours  minutes  seconds
0 2013-12-15 00:50:00      0       50        0
1 2014-04-29 23:40:00     23       40        0
2 2012-12-30 00:21:00      0       21        0
3 2014-11-28 00:31:00      0       31        0
4 2013-10-26 23:11:00     23       11        0

# extracting time from the date column:

In [20]:
time["time"] = time["date"].dt.time
time.head()

                 date  hours  minutes  seconds      time
0 2013-12-15 00:50:00      0       50        0  00:50:00
1 2014-04-29 23:40:00     23       40        0  23:40:00
2 2012-12-30 00:21:00      0       21        0  00:21:00
3 2014-11-28 00:31:00      0       31        0  00:31:00
4 2013-10-26 23:11:00     23       11        0  23:11:00

In [21]:
import datetime
today = datetime.datetime.today()
today

datetime.datetime(2025, 2, 11, 11, 28, 31, 354923)

In [22]:
(today - time["date"]).head()

0   4076 days 10:38:31.354923
1   3940 days 11:48:31.354923
2   4426 days 11:07:31.354923
3   3728 days 10:57:31.354923
4   4125 days 12:17:31.354923
Name: date, dtype: timedelta64[ns]

# we can pass differe parameters into the np.timedelta64(1, "parameter") and it sould be dividing to the resulting difference:
# "s" for seconds
# "m" for minutes
# "h" for hours

In [23]:
(today - time["date"])/np.timedelta64(1,"s")

0      3.522047e+08
1      3.404585e+08
2      3.824465e+08
3      3.221387e+08
4      3.564443e+08
           ...
995    4.074143e+08
996    3.487545e+08
997    3.889291e+08
998    3.989517e+08
999    3.360530e+08
Name: date, Length: 1000, dtype: float64

In [24]:
(today - time["date"])/np.timedelta64(1,"m")

0      5.870079e+06
1      5.674309e+06
2      6.374108e+06
3      5.368978e+06
4      5.940738e+06
           ...
995    6.790239e+06
996    5.812575e+06
997    6.482152e+06
998    6.649195e+06
999    5.600884e+06
Name: date, Length: 1000, dtype: float64

In [25]:
(today - time["date"])/np.timedelta64(1,"h")

0       97834.642043
1       94571.808710
2      106235.125376
3       89482.958710
4       99012.292043
           ...
995    113170.642043
996     96876.242043
997    108035.858710
998    110819.908710
999     93348.058710
Name: date, Length: 1000, dtype: float64